---
type: UISaveAsOptions
namespace: Autodesk.Revit.UI
version: 2024
members: 4
tags: [revit-api, class]
---

# UISaveAsOptions

`Autodesk.Revit.UI.UISaveAsOptions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | UISaveAsOptions | 2016 | `public UISaveAsOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ShowOverwriteWarning | 2016 | `public bool ShowOverwriteWarning { get ; set ; }` |